<?php
// Heading
$_['heading_title']			= 'Склады';

// Text
$_['text_success']			= 'Склады успешно обновлены!';
$_['text_list']				= 'Список Складов';
$_['text_add']				= 'Добавление склада';
$_['text_edit']				= 'Редактирование склада';

// Column
$_['column_name']			= 'Название склада';
$_['column_guid']			= 'Ид (GUID) склада';
$_['column_action']			= 'Действие';

// Entry
$_['entry_group']			= 'Название группы:';
$_['entry_name']			= 'Название склада:';
$_['entry_sort_order']		= 'Порядок сортировки:';

// Error
$_['error_permission']		= 'У Вас нет прав для изменения фильтров!';
$_['error_guid']			= 'Ид склада должно быть от 1 до 32 символов!';
$_['error_name']			= 'Название склада должно быть от 1 до 64 символов!';
